In [11]:
import pandas as pd

In [12]:
df = pd.DataFrame({
    'restaurant_id': [101,102,103,104,105,106,107],
    'address': ['A','B','C','D', 'E', 'F', 'G'],
    'city': ['London','London','London','Oxford','Oxford', 'Durham', 'Durham'],
    'sales': [10,500,48,12,21,22,14]
})
df.head()

   restaurant_id address    city  sales
0            101       A  London     10
1            102       B  London    500
2            103       C  London     48
3            104       D  Oxford     12
4            105       E  Oxford     21

- apply(func, axis=0):
call a function func along an axis of the DataFrame. It returns the result of applying func along the given axis.

- transform(func, axis=0):
call a function func on self producing a DataFrame with transformed values. It returns a DataFrame that has the same length as self.

Opt 1: groupby(), sum(), and merge()

In [13]:
city_sales = df.groupby('city')['sales'].sum().rename('city_total_sales').reset_index()
df_new = pd.merge(df, city_sales, how='left')
df_new['pct'] = df_new['sales'] / df_new['city_total_sales']
df_new

   restaurant_id address    city  sales  city_total_sales       pct
0            101       A  London     10               558  0.017921
1            102       B  London    500               558  0.896057
2            103       C  London     48               558  0.086022
3            104       D  Oxford     12                33  0.363636
4            105       E  Oxford     21                33  0.636364
5            106       F  Durham     22                36  0.611111
6            107       G  Durham     14                36  0.388889

Opt 2: groupby(), transform()

In [14]:
df['city_total_sales'] = df.groupby('city')['sales'].transform('sum')
df['pct'] = df['sales'] / df['city_total_sales']
df

   restaurant_id address    city  sales  city_total_sales       pct
0            101       A  London     10               558  0.017921
1            102       B  London    500               558  0.896057
2            103       C  London     48               558  0.086022
3            104       D  Oxford     12                33  0.363636
4            105       E  Oxford     21                33  0.636364
5            106       F  Durham     22                36  0.611111
6            107       G  Durham     14                36  0.388889

In [15]:
df.groupby('city')['sales'].sum()

city
Durham     36
London    558
Oxford     33
Name: sales, dtype: int64

In [16]:
df.groupby('city')['sales'].transform('sum')

0    558
1    558
2    558
3     33
4     33
5     36
6     36
Name: sales, dtype: int64